; domain
(define (domain my_domain)

    (:types
        location
    )

    (:predicates
        (at ?loc - location)            
        (con ?from ?to - location)          ; locations are connected
        (wall ?loc1 ?loc2 - location)       ; wall between locations
        (blocked ?loc - location)           ; location is blocked - agent cannot go there
        (wall-trigger ?trigger ?loc1 ?loc2) ; location is a trigger that creates wall between loc1 and loc2
    )

    (:action move
        :parameters (?from ?to - location)
        :precondition (and (not (blocked ?to)) (or (con ?from ?to) (con ?to ?from)) (at ?from) (not (or (wall ?from ?to) (wall ?to ?from))) )
        :effect (and 
            (at ?to) 
            (not (at ?from))
            (forall (?loc1 ?loc2 - location)
                (when (or (wall-trigger ?to ?loc1 ?loc2) (wall-trigger ?to ?loc2 ?loc1))
                    (and (wall ?loc1 ?loc2) (wall ?loc2 ?loc1))
                )
            )
        )
    )
)

; problem
(define (problem tilemap_generated)

    (:domain my_domain)
    
    (:objects
        a5 b5 c5 d5 e5 
        a4 b4 c4 d4 e4 
        a3 b3 c3 d3 e3 
        a2 b2 c2 d2 e2 
        a1 b1 c1 d1 e1 
         - location
    )
    
    (:init 
        (at c1)
        
        ; column connections
        (con a5 a4) (con b5 b4) (con c5 c4) (con d5 d4) (con e5 e4) 
        (con a4 a3) (con b4 b3) (con c4 c3) (con d4 d3) (con e4 e3) 
        (con a3 a2) (con b3 b2) (con c3 c2) (con d3 d2) (con e3 e2) 
        (con a2 a1) (con b2 b1) (con c2 c1) (con d2 d1) (con e2 e1) 
        
        
        
        ; row connections
        (con a5 b5) (con b5 c5) (con c5 d5) (con d5 e5) 
        (con a4 b4) (con b4 c4) (con c4 d4) (con d4 e4) 
        (con a3 b3) (con b3 c3) (con c3 d3) (con d3 e3) 
        (con a2 b2) (con b2 c2) (con c2 d2) (con d2 e2) 
        (con a1 b1) (con b1 c1) (con c1 d1) (con d1 e1) 
        
        
        (blocked b5) (blocked c3) (blocked d3) (blocked d2) 
        
        (wall a5 a4) (wall d5 d4) (wall b4 b3) (wall b3 a3) (wall e3 e2) 

        
    )
    
    (:goal
        (or (at a5) (at b5) (at c5) (at d5) (at e5) )
    )

)

; plan
1. (move c1 b1)
   deleted: (at c1)
   added: (at b1)
   goals met: 0 of 1
2. (move b1 a1)
   deleted: (at b1)
   added: (at a1)
   goals met: 0 of 1
3. (move a1 a2)
   deleted: (at a1)
   added: (at a2)
   goals met: 0 of 1
4. (move a2 a3)
   deleted: (at a2)
   added: (at a3)
   goals met: 0 of 1
5. (move a3 a4)
   deleted: (at a3)
   added: (at a4)
   goals met: 0 of 1
6. (move a4 b4)
   deleted: (at a4)
   added: (at b4)
   goals met: 0 of 1
7. (move b4 c4)
   deleted: (at b4)
   added: (at c4)
   goals met: 0 of 1
8. (move c4 c5)
   deleted: (at c4)
   added: (at c5)
   goals met: 1 of 1
